ENTER_TO_TASKS = 'Зайти в задачник 📓'

MAKE_CHANGES_IN_TASKS = 'Внести изменения в задачник🔧'

MAKE_CHANGES_IN_COMMUNITY = 'Внести изменения в сообщество 👥'

COMMUNITIES = 'Сообщества 👥'

OPTIONS = 'Настройки ⚙'

WHATS_NEW_TODAY = 'Что нового сегодня? ✨'

MORE_ABOUT_SCHOOL_TASKER = 'Подробнее о School Tasker 📋'

TODAY_IS_NO_CELEBRATIONS = '<strong>Сегодня никаких праздников и мероприятий</strong>'

USER_ROLE_WAS_SUCCESSFULLY_CHANGED = '<strong>✅Роль пользователя успешно изменена!</strong>'

CONTINUE_CHANGE_ROLES = '⬅ Ещё изменить роли'

TO_SCREEN_OF_MANAGING_COMMUNITY = '⬅ В экран управления сообществом'

MORE_ABOUT_SCHOOL_TASKER_YOU_CAN_FIND_HERE = '<strong>Подробнее о School Tasker Вы можете найти здесь:</strong>'

OUR_NEWS_CHANNEL_TG = 'Наш новостной канал 📰'

OUR_NEWS_CHANNEL_VK = 'Наш новостной канал в ВК 📰'

GITHUB_REPOSITORY = 'Репозиторий бота в Github 🤖'

CONTACT_WITH_DEVELOPER = 'Связаться с разработчиком 📞'

THERE_IS_NO_SCHOOL_TASKS_FOR_NOW = '<strong>На данный момент список заданий пуст!</strong>'

ARE_YOU_SURE_YOU_WANT_TO_DELETE_THIS_TASK = '<strong>Вы действительно хотите удалить данное задание?</strong>'

I_CANT_MAKE_YOUR_REQUEST = '<strong>Я не могу выполнить Ваш запрос - пожалуйста, повторите попытку</strong>'

MAKE_ANOTHER_TRY = '🔄 Повторить попытку'

TO_THE_REDACTOR_MENU = '⬅️ В меню редактора'

DELETE_MORE_TASKS = '⬅️ Удалить  ещё задание'

TASK_WAS_SUCCESSFULLY_DELETED = '✅<strong>Задание успешно удалено!</strong>'

WHICH_FROM_THIS_TASKS_YOU_WANT_TO_DELETE = '<strong>Какое из этих заданий Вы хотите удалить?</strong>'

WHICH_FROM_THIS_TASKS_YOU_WANT_TO_CHANGE = '<strong>Какое из этих заданий Вы хотите изменить?</strong>'

ON_WHICH_MONTH_WILL_BE_TASK = '<strong>На какой месяц будет дано задание?</strong>'

WHICH_CHANGES_YOU_WANT_TO_DO = '<strong>Какие изменения Вы хотите внести в задачник?</strong>'

ADD_TASK = 'Добавить задание ➕'

CHANGE_TASK = 'Изменить задание ✖'

DELETE_TASK = 'Удалить задание ➖'

WHICH_ITEM_WILL_BE_TASK = '<strong>По какому предмету будет задание?</strong>'

THERE_IS_NO_ITEMS_IN_COMMUNITY = '<strong>В сообществе пока нету предметов!</strong>'

WHICH_GROUP_WILL_BE_TASK = '<strong>Какой группе дано задание?</strong>'

ENTER_TEXT_OF_TASK = '<strong>Введите текст задания:</strong>'

NAME_OF_YOUR_COMMUNITY_WAS_SUCCESSFULLY_CHANGED = '<strong>Название Вашего сообщества успешно изменено!</strong>'

CHANGE_COMMUNITY_NAME_AGAIN = '⬅ Ещё раз изменить название сообщества'

PASSWORD_OF_YOUR_COMMUNITY_WAS_SUCCESSFULLY_CHANGED = '<strong>Пароль Вашего сообщества был успешно изменён!</strong>'

CHANGE_COMMUNITY_PASSWORD_AGAIN = '⬅ Ещё раз изменить пароль сообщества'

ITEM_NAME_WAS_SUCCESSFULLY_CHANGED = '<strong>Название предмета успешно изменено!</strong>'

CHANGE_ITEM_NAME_AGAIN = '⬅ Ещё раз изменить название предмета'

TO_THE_ITEM_SCREEN = '⬅ В экран управления предметом'

ITEM_ROD_NAME_WAS_SUCCESSFULLY_CHANGED = '<strong>Название предмета в дательном падеже успешно изменено!</strong>'

CHANGE_ITEM_ROD_NAME_AGAIN = '⬅ Ещё раз изменить название предмета в дательном падеже'

ITEM_GROUP_NUMBER_WAS_SUCCESSFULLY_CHANGED = '<strong>Количество групп предмета было успешно изменено!</strong>'

CHANGE_ITEM_GROUP_NUMBER_AGAIN = '⬅ Ещё раз изменить количество групп предмета'

ITEM_EMOJI_WAS_SUCCESSFULLY_CHANGED = '<strong>Эмодзи предмета был успешно изменён!</strong>'

CHANGE_ITEM_EMOJI_AGAIN = '⬅ Ещё раз изменить эмодзи предмета'

YOUR_ITEM_WAS_SUCCESSFULLY_CREATED = '<strong>Ваш предмет успешно создан и добавлен в Ваш класс!</strong>'

CREATE_MORE_ITEM = '⬅ Создать ещё предмет'

YOUR_COMMUNITY_WAS_SUCCESSFULLY_CREATED = '<strong>✅ Ваше сообщество было успешно создано!\n Не забудьте добавить к нему школьные предметы, чтобы Вы и администраторы смогли добавлять задания!</strong>'

YOU_SUCCESSFULLY_JOINED_COMMUNITY = '<strong>✅ Вы успешно зашли в сообщество! </strong>'

JOIN_TO_MORE_COMMUNITIES = '⬅ Ещё присоединиться'

TO_THE_COMMUNITIES_SCREEN = 'В экран сообществ'

ON_WHICH_DAY_WILL_BE_TASK = '<strong>На какой день дано задание?</strong>'

SEND_PHOTOS_THAT_TASK_NEEDS = '<strong>Отправьте в чат фотографии, которые нужно закрепить к заданию:</strong>'

SUCCESSFULLY_GOT_WHAT_YOU_WANT_TO_DO = '<strong>✅ Успешно получено! Что вы ещё хотите сделать?</strong>'

CREATE_TASK = 'Создать задание➕'

DELETE_SENDED_TASKS = 'Удалить присланные фотографии 🗑️'

ARE_YOU_SURE_YOU_WANT_TO_DELETE_PHOTOS = (
    '<strong>Вы точно уверены, что хотите удалить присланные Вами изображения?</strong>'
)

DELETE = 'Удалить 🗑️'

PHOTOS_WAS_DELETED = '<strong>✅ Фотографии успешно удалены! Что вы ещё хотите сделать?</strong>'

ENTER_NEW_TASK_TEXT = '<strong>Введите новый текст задания:</strong>'

TASK_WAS_SUCCESSFULLY_CHANGED = '<strong>✅ Задание успешно изменено!</strong>'

CHANGE_MORE_TASKS = '⬅ Изменить ещё задания'

WHAT_YOU_WANT_TO_CHANGE_IN_THIS_TASK = '<strong>Что Вы хотите изменить в данном задании?</strong>'

ENTER_NEW_ITEM_ROD_NAME = '<strong>Введите новое название предмета в дательном падеже: </strong>'

SELECT_ONE_OF_COMMUNITIES = '<strong>Выберите одно из предоставленных сообществ:</strong>'

YOU_IN_NO_COMMUNITY_FOR_NOW = (
    '<strong>На данный момент Вы не состоите в каком-нибудь сообществе, '
    'чтобы посмотреть домашнее задание</strong>'
)

ENTER_PASSWORD_OF_YOUR_COMMUNITY = '<strong>Введите пароль Вашего сообщества:</strong>'

ENTER_NEW_PASSWORD_FOR_COMMUNITY = '<strong>Введите новый пароль для сообщества:</strong>'

ENTER_NAME_OF_YOUR_COMMUNITY = '<strong>Введите название Вашего сообщества:</strong>'

ENTER_NEW_NAME_FOR_COMMUNITY = '<strong>Введите новое название для сообщества:</strong>'

ENTER_PASSWORD_OF_COMMUNITY = '<strong>Введите пароль сообщества:</strong>'

SELECT_INTERESTING_COMMUNITY = '<strong>Выберите интересующее Вас сообщество:</strong>'

THERE_IS_EMPTY_FOR_A_WHILE = '<strong>Пока что тут пусто!</strong>'

ENTER_ITEM_ROD_NAME = '<strong>Введите название предмета в дательном падеже: </strong>'

ENTER_ITEM_NAME = '<strong>Введите название предмета:</strong>'

SELECT_ACTION = '<strong>Выберите действие:</strong>'

ENTER_GROUP_NUMBER_OF_THIS_ITEM = '<strong>Введите количество групп данного предмета:</strong>'

ENTER_EMOJI_THAT_ASSOCIATES_WITH_ITEM = '<strong>Введите эмоджи, ассоциирующийся с предметом:</strong>'

WHAT_DO_YOU_WANT_TO_DO = '<strong>Какое действие Вы хотите выполнить?</strong>'

BUTTON_BACK = '⬅ Назад'

BUTTON_BACK_TO_MENU = '⬅ Вернуться на главный экран'

BUTTON_CREATE_ITEM = 'Создать предмет ➕'

SELECT_USER = '<strong>Выберите пользователя:</strong>'

SELECT_AVAILABLE_COMMUNITY = '<strong>Выберите доступное Вам сообщество:</strong>'

SELECT_OPTIONS = '<strong>Выберите подходящие для Вас параметры</strong>'

ARE_YOU_SURE_YOU_WANT_TO_DELETE_THIS_ITEM = '<strong>Вы точно уверены, что хотите удалить данный предмет?</strong>'

ENTER_EMOJI_FOR_ITEM = '<strong>Введите новый эмодзи, ассоциирующийся с предметом: </strong>'

ENTER_GROUP_NUMBER = '<strong>Введите новое количество групп:</strong>'

WHAT_DO_YOU_WANT_TO_DO_WITH_THIS_ITEM = '<strong>Что Вы хотите сделать с данным предметом?</strong>'

ENTER_NEW_ITEM_NAME = '<strong>Введите новое название предмета:</strong>'
